BusinessProcesses/БП_ОбработкаСтрокиЗаказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<BusinessProcess>
		<Properties>
			<Name>БП_ОбработкаСтрокиЗаказа</Name>
			<Task>Task.БП_ЗадачиИсполнителей</Task>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РодительскийБизнесПроцес</Name>
					<Type>
						<v8:Type>cfg:BusinessProcessRef.БП_ОбработкаЗаказа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусСтрокиЗаказа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.БП_СтатусыСтрокЗазака</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладСОстаткомТовара</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладВыдачи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказПоставщику</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнутреннийЗаказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВнутреннийЗаказ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСтроки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособДоставки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.БП_СпособыДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресДоставки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПеремещениеТоваров</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресВнутреннейДоставки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументДоствкиВнутренний</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТТН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийДляПеремещенияТовара</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадачаДляПеремещения</Name>
					<Type>
						<v8:Type>cfg:TaskRef.БП_ЗадачиИсполнителей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникПолученияТовара</Name>
					<Type>
						<v8:Type>cfg:EnumRef.БП_ИсточникиПолученияТовара</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПеремещениеТовараПодОтветственностьМенеджера</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</BusinessProcess>
</MetaDataObject>

AccumulationRegisters/ТоварыНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыНаСкладах</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Качество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ТоварыВРезервеНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыВРезервеНаСкладах</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРезерва</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйОрдерНаТовары</v8:Type>
						<v8:Type>cfg:DocumentRef.ВнутреннийЗаказ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ЗначенияСвойствОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияСвойствОбъектов</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СвойстваОбъектов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СвойстваОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтатусыЗаказаПокупателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>СтатусыЗаказаПокупателей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КФормированию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/БП_ИсточникиПолученияТовара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>БП_ИсточникиПолученияТовара</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПереместитьСоСкладаПартнера</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаказатьУПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыборНеТребуется</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/БП_СтатусыСтрокЗазака.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>БП_СтатусыСтрокЗазака</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ТоварВПутиСДрСклада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТоварВПутиОтПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтказПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АннулированКлиентом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТоварОтгружен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Зарегистрирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГотовКОтгрузке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтказСклада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодтвержденОстаток</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РазмещенВЗаказеПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправленВТК</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыВнутреннегоЗаказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыВнутреннегоЗаказа</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НаСклад</Name>
					<Comment>(общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВПодразделение</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОперацийПеремещениеТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПеремещениеТоваров</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ТоварыПродукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТоварыПродукцияПоОрдерам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оборудование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БланкиСтрогогоУчета</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОперацийРезервированиеТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыОперацийРезервированиеТоваров</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоСкладам</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоЗаказам</Name>
					<Comment>(Упр)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСкладамИЗаказам</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

BusinessProcesses/БП_ОбработкаСтрокиЗаказа/Ext/ObjectModule.bsl
Процедура ЗаказОтказанПоставщикомПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	////Если ЗаказПоставщику.БП_СтатусЗаказа = Перечисления.БП_СтатусыЗаказовПоставщику.Отказан Тогда 
	Если ЗаказПоставщику.СтатусЗаказа = Перечисления.СтатусыЗаказаПокупателей.Отменен Тогда 
		Результат = Истина;
	Иначе
		Результат = Ложь;	
	КонецЕсли;
КонецПроцедуры

Процедура ТоварВНаличииНаСкладеВыдачиПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	КоличествоОстаток =0;
	
	
	
	ЗапросПоОстатку = новый запрос;
	ЗапросПоОстатку.Текст = "ВЫБРАТЬ
	                        |	ТоварыНаСкладахОстатки.Номенклатура,
	                        |	ТоварыНаСкладахОстатки.КоличествоОстаток
	                        |ИЗ
	                        |	РегистрНакопления.ТоварыНаСкладах.Остатки(
	                        |			&Дата,
	                        |			Склад = &склад
	                        |				И Номенклатура = &Номенклатура
	                        |				И ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры) КАК ТоварыНаСкладахОстатки";
	ЗапросПоОстатку.УстановитьПараметр("Дата",ТекущаяДата()+2);
	ЗапросПоОстатку.УстановитьПараметр("Номенклатура",Номенклатура);
	ЗапросПоОстатку.УстановитьПараметр("ХарактеристикаНоменклатуры",ХарактеристикаНоменклатуры);
	ЗапросПоОстатку.УстановитьПараметр("Склад",СкладВыдачи);
	
	
	РезультатЗапроса = ЗапросПоОстатку.Выполнить().Выгрузить();
	
	
	Если РезультатЗапроса.Количество() > 0 Тогда 
		КоличествоОстаток = РезультатЗапроса[0].КоличествоОстаток;	
	КонецЕсли;
	
	Если КоличествоОстаток >= Количество Тогда 
		Результат = Истина;	
		СкладСОстаткомТовара = СкладВыдачи;
	КонецЕсли;
	
	Если ИсточникПолученияТовара = Перечисления.БП_ИсточникиПолученияТовара.ЗаказатьУПоставщика Тогда 
		Результат = Ложь;
	КонецЕсли;
	
КонецПроцедуры

Процедура ТоварНаДругомСкладеПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	КоличествоОстаток =0;
	//Проверка на складе с резервом товара
	
	ЗапросПоОстатку = новый запрос;
	ЗапросПоОстатку.Текст = "ВЫБРАТЬ
	|	ТоварыВРезервеНаСкладахОстатки.Склад
	|ИЗ
	|	РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки КАК ТоварыВРезервеНаСкладахОстатки
	|ГДЕ
	|	ТоварыВРезервеНаСкладахОстатки.Номенклатура = &Номенклатура
	|	И ТоварыВРезервеНаСкладахОстатки.ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры
	|	И ТоварыВРезервеНаСкладахОстатки.ДокументРезерва = &ДокументРезерва";
	ЗапросПоОстатку.УстановитьПараметр("Номенклатура",Номенклатура);
	ЗапросПоОстатку.УстановитьПараметр("ХарактеристикаНоменклатуры",ХарактеристикаНоменклатуры);
	ЗапросПоОстатку.УстановитьПараметр("ДокументРезерва",РодительскийБизнесПроцес.ЗаказПокупателя);
	
	РезультатЗапроса = ЗапросПоОстатку.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() Тогда 
		ЗапросПоТекущемуОстатку = новый запрос;
		ЗапросПоТекущемуОстатку.Текст = "ВЫБРАТЬ
		|	ТоварыНаСкладахОстатки.Номенклатура,
		|	ТоварыНаСкладахОстатки.КоличествоОстаток,
		|	ТоварыНаСкладахОстатки.Склад КАК Склад
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Остатки(
		|			&Дата,
		|			Склад = &склад
		|				И Номенклатура = &Номенклатура
		|				И ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры) КАК ТоварыНаСкладахОстатки";
		ЗапросПоТекущемуОстатку.УстановитьПараметр("Дата",ТекущаяДата());
		ЗапросПоТекущемуОстатку.УстановитьПараметр("Номенклатура",Номенклатура);
		ЗапросПоТекущемуОстатку.УстановитьПараметр("ХарактеристикаНоменклатуры",ХарактеристикаНоменклатуры);
		ЗапросПоТекущемуОстатку.УстановитьПараметр("склад",РезультатЗапроса[0].Склад);
		РезультатЗапроса = ЗапросПоТекущемуОстатку.Выполнить().Выгрузить();
		
		Если РезультатЗапроса.Количество() > 0 Тогда 
			КоличествоОстаток = РезультатЗапроса[0].КоличествоОстаток;	
		КонецЕсли;
		
		Если КоличествоОстаток >= Количество Тогда 
			ЭтотОбъект.СкладСОстаткомТовара = РезультатЗапроса[0].Склад;
			ЭтотОбъект.Записать();
			Результат = Истина;		
		КонецЕсли;
		
		Если ИсточникПолученияТовара = Перечисления.БП_ИсточникиПолученияТовара.ЗаказатьУПоставщика Тогда 
			Результат = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	
	 Если не Результат Тогда 
	
	ЗапросПоОстатку = новый запрос;
	ЗапросПоОстатку.Текст = "ВЫБРАТЬ
	                        |	ТоварыНаСкладахОстатки.Номенклатура,
	                        |	ТоварыНаСкладахОстатки.КоличествоОстаток,
	                        |	ТоварыНаСкладахОстатки.Склад КАК Склад
	                        |ИЗ
	                        |	РегистрНакопления.ТоварыНаСкладах.Остатки(
	                        |			&Дата,
	                        |			Склад <> &склад
	                        |				И Номенклатура = &Номенклатура
	                        |				И ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры) КАК ТоварыНаСкладахОстатки";
	ЗапросПоОстатку.УстановитьПараметр("Дата",ТекущаяДата());
	ЗапросПоОстатку.УстановитьПараметр("Номенклатура",Номенклатура);
	ЗапросПоОстатку.УстановитьПараметр("ХарактеристикаНоменклатуры",ХарактеристикаНоменклатуры);
	ЗапросПоОстатку.УстановитьПараметр("склад",СкладВыдачи);
	
	
	РезультатЗапроса = ЗапросПоОстатку.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() > 0 Тогда 
		КоличествоОстаток = РезультатЗапроса[0].КоличествоОстаток;
		
		Если КоличествоОстаток >= Количество Тогда 
			
			ЭтотОбъект.СкладСОстаткомТовара = РезультатЗапроса[0].Склад;
			ЭтотОбъект.Записать();
			Результат = Истина;		
		КонецЕсли;
		
	КонецЕсли;
		
	Если ИсточникПолученияТовара = Перечисления.БП_ИсточникиПолученияТовара.ЗаказатьУПоставщика Тогда 
		Результат = Ложь;
	КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ТоварОтказанПриЗавершении(ТочкаМаршрутаБизнесПроцесса, Отказ)
	
	СтатусСтрокиЗаказа = Перечисления.БП_СтатусыСтрокЗазака.ОтказСклада;
	Отбор = новый структура;
	Отбор.Вставить("Номенклатура",Номенклатура);
	Отбор.Вставить("ХарактеристикаНоменклатуры",ХарактеристикаНоменклатуры);
	Отбор.Вставить("Количество",Количество);
	
	РодительскийБизнесПроцесОб = РодительскийБизнесПроцес.ПолучитьОбъект();
	Строки = РодительскийБизнесПроцесОб.СтрокиЗаказа.НайтиСтроки(Отбор);
	
	Для Каждого строка из Строки цикл
		Строка.СтатусСтрокиЗаказа = Перечисления.БП_СтатусыСтрокЗазака.ОтказПоставщика;
	КонецЦикла;
	РодительскийБизнесПроцесОб.Записать();
КонецПроцедуры

Процедура ТоварГотовКОтгрузкеПриЗавершении(ТочкаМаршрутаБизнесПроцесса, Отказ)
	СтатусСтрокиЗаказа = Перечисления.БП_СтатусыСтрокЗазака.ГотовКОтгрузке;
	ЭтотОбъект.СтатусСтрокиЗаказа = Перечисления.БП_СтатусыСтрокЗазака.ГотовКОтгрузке;
	ЭтотОбъект.Записать();
	
	
	////СтрокаЗаказа = ry_ОбщиеПроцедуры.ПолучитьСтрокуЗаказа(РодительскийБизнесПроцес.ЗаказПокупателя,Номенклатура,ХарактеристикаНоменклатуры,Цена);
	//Чернавцев Н.А. по задаче №45525 07.07.2021 Начало
	//Функционал устарел
	//ДокументДвиженияСтатусов = ПолучитьДокументДвиженияСтрок(РодительскийБизнесПроцес.ЗаказПокупателя);	
	//Если ЗначениеЗаполнено(ДокументДвиженияСтатусов) Тогда 
	//	Если ЗначениеЗаполнено(СтрокаЗаказа) Тогда 
	//		ДокДвиженияОБ = ДокументДвиженияСтатусов.ПолучитьОбъект();
	//		
	//		СтрокиЗаказа = ДокДвиженияОБ.ТабСтрок.НайтиСтроки(Новый структура("СтрокаЗаказа",СтрокаЗаказа));
	//		
	//		Для каждого СтрокаСтрокиЗаказа из СтрокиЗаказа цикл
	//			СтрокаСтрокиЗаказа.ВСтатус = Справочники.СтатусыСтрокиЗаказа.ТоварНаСкладеПродажи;
	//			СтрокаСтрокиЗаказа.ВОткуда = СкладВыдачи; 
	//		КонецЦикла;
	//		ДокДвиженияОБ.Записать(РежимЗаписиДокумента.Проведение);
	//	КонецЕсли;
	//КонецЕсли;
	//Чернавцев Н.А. по задаче №45525 07.07.2021 Конец
КонецПроцедуры

Процедура СистемаЖдетРеакциюПоставщикаОбработкаИнтерактивнойАктивации(ТочкаМаршрутаБизнесПроцесса, Задача, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура СозданиеВнутреннегоЗаказаОбработка(ТочкаМаршрутаБизнесПроцесса)

КонецПроцедуры

Процедура ОтказСкладаПартнеровПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)

	Если СтатусСтрокиЗаказа = Перечисления.БП_СтатусыСтрокЗазака.ОтказСклада Тогда 
		Результат = Истина;
	Иначе 
		Результат = Ложь;	
	КонецЕсли;
		
КонецПроцедуры

Процедура ОтказСкладаПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	Если СтатусСтрокиЗаказа = Перечисления.БП_СтатусыСтрокЗазака.ОтказСклада Тогда 
		Результат = Истина;
	Иначе 
		Результат = Ложь;	
	КонецЕсли;

КонецПроцедуры

//Содание внутреннего заказа и переопределение размещений
Процедура СоздатьВнутреннийЗаказИПеремещениеОбработка(ТочкаМаршрутаБизнесПроцесса)
Попытка	
	ЗаписьЖурналаРегистрации("БП_СозданиеДокументов.ВнутренийЗаказ.Начало", 
        УровеньЖурналаРегистрации.Информация, , ,
        "Начало");
		
	Документ = Документы.ВнутреннийЗаказ.СоздатьДокумент();
	Документ.ВидЗаказа     = Перечисления.ВидыВнутреннегоЗаказа.НаСклад;
	Документ.Дата 	       = Дата;
	Документ.Заказчик      = СкладВыдачи;
	Документ.Организация   = РодительскийБизнесПроцес.ЗаказПокупателя.Организация;
	Документ.Комментарий   = "Созданно Бизнес-процессом";
	Документ.Подразделение = СкладВыдачи.Подразделение;
	Документ.ДокументОснование = РодительскийБизнесПроцес.ЗаказПокупателя; 
	
	Товар = Документ.Товары.Добавить();
	Товар.Номенклатура 	   			 = Номенклатура;
	Товар.ХарактеристикаНоменклатуры = ХарактеристикаНоменклатуры;
	Товар.ЕдиницаИзмерения 			 = Номенклатура.ЕдиницаХраненияОстатков;
	Товар.Коэффициент 	   			 = 1;
	Товар.Количество 	   			 = Количество;
	Товар.Размещение                 = СкладСОстаткомТовара;
	
	Документ.Записать(РежимЗаписиДокумента.Запись);
	ЗаписьЖурналаРегистрации("БП_СозданиеДокументов.ВнутренийЗаказ.Запись", 
        УровеньЖурналаРегистрации.Информация, , ,
        "Запись документа");

	Документ.Записать(РежимЗаписиДокумента.Проведение);
	
	ЗаписьЖурналаРегистрации("БП_СозданиеДокументов.ВнутренийЗаказ.Запись", 
        УровеньЖурналаРегистрации.Информация, , ,
        "Запись документа");
	
	ЗаказПокупателя = ЭтотОбъект.РодительскийБизнесПроцес.ЗаказПокупателя;
	ЗаказПокупателяоб =  ЗаказПокупателя.ПолучитьОбъект();
	
	ОтборСтроки = новый Структура;
	ОтборСтроки.Вставить("Номенклатура",Номенклатура);
	ОтборСтроки.Вставить("ХарактеристикаНоменклатуры",ХарактеристикаНоменклатуры);
	ОтборСтроки.Вставить("Количество",Количество);
	ОтборСтроки.Вставить("НомерСтроки",НомерСтроки);	
	
	СтрокиЗаказа = ЗаказПокупателяоб.Товары.НайтиСтроки(ОтборСтроки);
	Если СтрокиЗаказа.Количество()=1 Тогда 
		СтрокаЗаказа = СтрокиЗаказа[0];
		СтрокаЗаказа.размещение = Документ.Ссылка;
	КонецЕсли;
	
	ЗаказПокупателяоб.Записать(РежимЗаписиДокумента.Проведение);
	
	ДокументПеремещения = Документы.ПеремещениеТоваров.СоздатьДокумент();
	ДокументПеремещения.ВидОперации      = Перечисления.ВидыОперацийПеремещениеТоваров.ТоварыПродукцияПоОрдерам;
	ДокументПеремещения.Дата 	         = Дата;
	ДокументПеремещения.ВнутреннийЗаказ  = Документ.Ссылка;
	ДокументПеремещения.Организация      = РодительскийБизнесПроцес.ЗаказПокупателя.Организация;
	ДокументПеремещения.Комментарий      = "Созданно Бизнес-процессом";
	ДокументПеремещения.Подразделение    = СкладВыдачи.Подразделение;
	ДокументПеремещения.СкладОтправитель = СкладСОстаткомТовара;
	ДокументПеремещения.СкладПолучатель  = СкладВыдачи;
	ДокументПеремещения.ОтражатьВУправленческомУчете = Истина;
	ДокументПеремещения.ТипПеремещения   = Перечисления.ТипыПеремещенияТовара.ПодКлиента;
	ДокументПеремещения.ЗаказПокупателя =  РодительскийБизнесПроцес.ЗаказПокупателя;

	
	Товар = ДокументПеремещения.Товары.Добавить();
	Товар.Номенклатура 	   			 = Номенклатура;
	Товар.ХарактеристикаНоменклатуры = ХарактеристикаНоменклатуры;
	Товар.ЕдиницаИзмерения 			 = Номенклатура.ЕдиницаХраненияОстатков;
	Товар.Коэффициент 	   			 = 1;
	Товар.Количество 	   			 = Количество;
	Товар.ДокументРезерва            = Документ.Ссылка;
	Товар.Качество                   = Справочники.Качество.Новый;
	Товар.ВнутреннийЗаказ			 = Документ.Ссылка;
	
	ДокументПеремещения.Записать(РежимЗаписиДокумента.Запись);
	ДокументПеремещения.Записать(РежимЗаписиДокумента.Проведение);
	
	ВнутреннийЗаказ    = Документ.Ссылка;
	ПеремещениеТоваров = ДокументПеремещения.Ссылка;
	ЭтотОбъект.Записать();
Исключение
	ЗаписьЖурналаРегистрации("БП_СозданиеДокументов.ВнутренийЗаказ.Исключение", 
        УровеньЖурналаРегистрации.Информация, , ,
        "исключение" + ОписаниеОшибки());
	
	
КонецПопытки;
КонецПроцедуры

Процедура ПроверитьОстатокСкладаПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	Для Каждого  Задача из ФормируемыеЗадачи цикл
		Задача.Подразделение = СкладСОстаткомТовара.Подразделение;
		Задача.Номенклатура  		      = Номенклатура;
		Задача.ХарактеристикаНоменклатуры = ХарактеристикаНоменклатуры;
		Задача.СкладДляПроверкиОстатка    = СкладСОстаткомТовара;
		Задача.типЗадачи                  = Перечисления.БП_ТипыЗадач.ПроверитьОстаток;
		Задача.Количество                 = Количество;
		Задача.ЗаказПокупателя			  = РодительскийБизнесПроцес.ЗаказПокупателя;
	КонецЦикла;
КонецПроцедуры

Процедура ПроверитьОстатокПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	Для Каждого  Задача из ФормируемыеЗадачи цикл
		Задача.Подразделение              = СкладВыдачи.Подразделение;
		Задача.Номенклатура  		      = Номенклатура;
		Задача.ХарактеристикаНоменклатуры = ХарактеристикаНоменклатуры;
		Задача.СкладДляПроверкиОстатка    = СкладВыдачи;
		Задача.типЗадачи                  = Перечисления.БП_ТипыЗадач.ПроверитьОстаток;
		Задача.Количество				  = Количество;
		Задача.ЗаказПокупателя			  = РодительскийБизнесПроцес.ЗаказПокупателя;
	КонецЦикла;
КонецПроцедуры

Процедура СоздатьЗаказПоставщикуПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	Для Каждого  Задача из ФормируемыеЗадачи цикл
		Задача.Номенклатура  		      = Номенклатура;
		Задача.ХарактеристикаНоменклатуры = ХарактеристикаНоменклатуры;
		Задача.типЗадачи                  = Перечисления.БП_ТипыЗадач.СоздатьЗаказПоставщику;
		Задача.Количество				  = Количество;
		Задача.ЗаказПокупателя			  = РодительскийБизнесПроцес.ЗаказПокупателя;
	КонецЦикла;
КонецПроцедуры

Процедура ПеревестиСтатусВТоварОтказанПоставщикомОбработка(ТочкаМаршрутаБизнесПроцесса)
	
	////СтрокаЗаказа = ry_ОбщиеПроцедуры.ПолучитьСтрокуЗаказа(РодительскийБизнесПроцес.ЗаказПокупателя,Номенклатура,ХарактеристикаНоменклатуры,Цена);
	
	ЭтотОбъект.СтатусСтрокиЗаказа = Перечисления.БП_СтатусыСтрокЗазака.ОтказПоставщика;
	ЭтотОбъект.Записать();
	
	////СтрокаЗаказа = ry_ОбщиеПроцедуры.ПолучитьСтрокуЗаказа(РодительскийБизнесПроцес.ЗаказПокупателя,Номенклатура,ХарактеристикаНоменклатуры,Цена);
	//Чернавцев Н.А. по задаче №45525 07.07.2021 Начало
	//Функционал устарел
	//ДокументДвиженияСтатусов = ПолучитьДокументДвиженияСтрок(РодительскийБизнесПроцес.ЗаказПокупателя);	
	//Если ЗначениеЗаполнено(ДокументДвиженияСтатусов) Тогда 
	//	Если ЗначениеЗаполнено(СтрокаЗаказа) Тогда 
	//		ДокДвиженияОБ = ДокументДвиженияСтатусов.ПолучитьОбъект();
	//		
	//		СтрокиЗаказа = ДокДвиженияОБ.ТабСтрок.НайтиСтроки(Новый структура("СтрокаЗаказа",СтрокаЗаказа));
	//		
	//		Для каждого СтрокаСтрокиЗаказа из СтрокиЗаказа цикл
	//			СтрокаСтрокиЗаказа.ВСтатус = Справочники.СтатусыСтрокиЗаказа.ОтказПоставщика;
	//			СтрокаСтрокиЗаказа.ВОткуда = СкладВыдачи; 
	//		КонецЦикла;
	//		ДокДвиженияОБ.Записать(РежимЗаписиДокумента.Проведение);
	//	КонецЕсли;
	//КонецЕсли;
	//Чернавцев Н.А. по задаче №45525 07.07.2021 Конец
	
	СтатусСтрокиЗаказа = Перечисления.БП_СтатусыСтрокЗазака.ОтказПоставщика;
	ЭтотОбъект.записать();
	
КонецПроцедуры

Процедура ПеревестиСтатусПодтвержденОстатокОбработка(ТочкаМаршрутаБизнесПроцесса)
	
	ЭтотОбъект.СтатусСтрокиЗаказа = Перечисления.БП_СтатусыСтрокЗазака.ПодтвержденОстаток;
	ЭтотОбъект.Записать();
	
////	СтрокаЗаказа = ry_ОбщиеПроцедуры.ПолучитьСтрокуЗаказа(РодительскийБизнесПроцес.ЗаказПокупателя,Номенклатура,ХарактеристикаНоменклатуры,Цена);
	
////	СтрокаЗаказа = ry_ОбщиеПроцедуры.ПолучитьСтрокуЗаказа(РодительскийБизнесПроцес.ЗаказПокупателя,Номенклатура,ХарактеристикаНоменклатуры,Цена);
	//Чернавцев Н.А. по задаче №45525 07.07.2021 Начало
	//Функционал устарел
	//ДокументДвиженияСтатусов = ПолучитьДокументДвиженияСтрок(РодительскийБизнесПроцес.ЗаказПокупателя);	
	//Если ЗначениеЗаполнено(ДокументДвиженияСтатусов) Тогда 
	//	Если ЗначениеЗаполнено(СтрокаЗаказа) Тогда 
	//		ДокДвиженияОБ = ДокументДвиженияСтатусов.ПолучитьОбъект();
	//		
	//		СтрокиЗаказа = ДокДвиженияОБ.ТабСтрок.НайтиСтроки(Новый структура("СтрокаЗаказа",СтрокаЗаказа));
	//		
	//		Для каждого СтрокаСтрокиЗаказа из СтрокиЗаказа цикл
	//			СтрокаСтрокиЗаказа.ВСтатус = Справочники.СтатусыСтрокиЗаказа.ПодтвержденныйРезерв;
	//			СтрокаСтрокиЗаказа.ВОткуда = СкладВыдачи; 
	//		КонецЦикла;
	//		ДокДвиженияОБ.Записать(РежимЗаписиДокумента.Проведение);
	//	КонецЕсли;
	//КонецЕсли;
	//Чернавцев Н.А. по задаче №45525 07.07.2021 Конец

	
КонецПроцедуры

Процедура ОформитьРасходныйОрдерПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	Для Каждого  Задача из ФормируемыеЗадачи цикл
		Задача.Номенклатура  		      = Номенклатура;
		Задача.ХарактеристикаНоменклатуры = ХарактеристикаНоменклатуры;
		Задача.СкладВыдачи 				  = СкладВыдачи;
		Задача.ПеремещениеТоваров		  = ПеремещениеТоваров;
		Задача.ВнутреннийЗаказ            = ВнутреннийЗаказ;
		Задача.подразделение		      = ПеремещениеТоваров.СкладОтправитель.Подразделение;
		Задача.Количество                 = Количество;
		Задача.типЗадачи                  = Перечисления.БП_ТипыЗадач.СоздатьРасходныйОрдер;
		Задача.ЗаказПокупателя			  = РодительскийБизнесПроцес.ЗаказПокупателя;
	КонецЦикла;
КонецПроцедуры

Процедура ОформитьПриходныйОрдерПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	Для Каждого  Задача из ФормируемыеЗадачи цикл
		Задача.Номенклатура  		      = Номенклатура;
		Задача.ХарактеристикаНоменклатуры = ХарактеристикаНоменклатуры;
		Задача.СкладВыдачи 				  = СкладВыдачи;
		Задача.ПеремещениеТоваров		  = ПеремещениеТоваров;
		Задача.ВнутреннийЗаказ            = ВнутреннийЗаказ;
		Задача.подразделение		      = ПеремещениеТоваров.СкладПолучатель.Подразделение;
		Задача.Количество                 = Количество;
		Задача.типЗадачи                  = Перечисления.БП_ТипыЗадач.СоздатьПриходныйОрдер;
		Задача.ЗаказПокупателя			  = РодительскийБизнесПроцес.ЗаказПокупателя;
	КонецЦикла;

КонецПроцедуры


Процедура ОтправитьТоварВДругоеПодразделениеПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	Для Каждого  Задача из ФормируемыеЗадачи цикл
		Задача.Номенклатура  		      = Номенклатура;
		Задача.ХарактеристикаНоменклатуры = ХарактеристикаНоменклатуры;
		Задача.СкладВыдачи 				  = СкладВыдачи;
		Задача.ПеремещениеТоваров		  = ПеремещениеТоваров;
		Задача.ВнутреннийЗаказ            = ВнутреннийЗаказ;
		Задача.подразделение		      = ПеремещениеТоваров.СкладОтправитель.Подразделение;
		Задача.Количество                 = Количество;
		Задача.типЗадачи                  = Перечисления.БП_ТипыЗадач.ОтправитьТовар;
		Задача.ЗаказПокупателя			  = РодительскийБизнесПроцес.ЗаказПокупателя;
		Задача.Комментарий				  = КомментарийДляПеремещенияТовара;
	КонецЦикла;

КонецПроцедуры

Процедура ПолучитьТоварПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	Для Каждого  Задача из ФормируемыеЗадачи цикл
		Задача.Номенклатура  		      = Номенклатура;
		Задача.ХарактеристикаНоменклатуры = ХарактеристикаНоменклатуры;
		Задача.СкладВыдачи 				  = СкладВыдачи;
		Задача.ПеремещениеТоваров		  = ПеремещениеТоваров;
		Задача.ВнутреннийЗаказ            = ВнутреннийЗаказ;
		Задача.подразделение		      = ПеремещениеТоваров.СкладПолучатель.Подразделение;
		Задача.Количество                 = Количество;
		Задача.типЗадачи                  = Перечисления.БП_ТипыЗадач.ПолучитьТовар;
		Задача.ЗаказПокупателя			  = РодительскийБизнесПроцес.ЗаказПокупателя;
	КонецЦикла;

КонецПроцедуры

Процедура СистемаЖдетРеакциюПоставщикаПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	Для Каждого  Задача из ФормируемыеЗадачи цикл
		Задача.типЗадачи                  = Перечисления.БП_ТипыЗадач.Прочее;
		Задача.ЗаказПокупателя			  = РодительскийБизнесПроцес.ЗаказПокупателя;
	КонецЦикла;
КонецПроцедуры

Процедура СистемаЖдетПриходаТовараОтПоставщикаПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	Для Каждого  Задача из ФормируемыеЗадачи цикл
		Задача.типЗадачи                  = Перечисления.БП_ТипыЗадач.Прочее;
		Задача.ЗаказПокупателя			  = РодительскийБизнесПроцес.ЗаказПокупателя;
		Задача.ЗаказПоставщику            = ЗаказПоставщику; 
	КонецЦикла;
КонецПроцедуры

Процедура ПеревестиСтатусРазмещенВЗаказеПоставвщикуОбработка(ТочкаМаршрутаБизнесПроцесса)
	
	
	////СтрокаЗаказа = ry_ОбщиеПроцедуры.ПолучитьСтрокуЗаказа(РодительскийБизнесПроцес.ЗаказПокупателя,Номенклатура,ХарактеристикаНоменклатуры,Цена);
		
	ЭтотОбъект.СтатусСтрокиЗаказа = Перечисления.БП_СтатусыСтрокЗазака.ОтказПоставщика;
	ЭтотОбъект.Записать();
	
	////СтрокаЗаказа = ry_ОбщиеПроцедуры.ПолучитьСтрокуЗаказа(РодительскийБизнесПроцес.ЗаказПокупателя,Номенклатура,ХарактеристикаНоменклатуры,Цена);
	//Чернавцев Н.А. по задаче №45525 07.07.2021 Начало
	//Функционал устарел
	//ДокументДвиженияСтатусов = ПолучитьДокументДвиженияСтрок(РодительскийБизнесПроцес.ЗаказПокупателя);	
	//Если ЗначениеЗаполнено(ДокументДвиженияСтатусов) Тогда 
	//	Если ЗначениеЗаполнено(СтрокаЗаказа) Тогда 
	//		ДокДвиженияОБ = ДокументДвиженияСтатусов.ПолучитьОбъект();
	//		
	//		СтрокиЗаказа = ДокДвиженияОБ.ТабСтрок.НайтиСтроки(Новый структура("СтрокаЗаказа",СтрокаЗаказа));
	//		
	//		Для каждого СтрокаСтрокиЗаказа из СтрокиЗаказа цикл
	//			СтрокаСтрокиЗаказа.ВСтатус = Справочники.СтатусыСтрокиЗаказа.РазмещенВЗаказеПоставщика;
	//			СтрокаСтрокиЗаказа.ВОткуда = СкладВыдачи; 
	//		КонецЦикла;
	//		ДокДвиженияОБ.Записать(РежимЗаписиДокумента.Проведение);
	//	КонецЕсли;
	//КонецЕсли;
	//Чернавцев Н.А. по задаче №45525 07.07.2021 Конец
	
	СтатусСтрокиЗаказа = Перечисления.БП_СтатусыСтрокЗазака.РазмещенВЗаказеПоставщика;
	ИсточникПолученияТовара = Перечисления.БП_ИсточникиПолученияТовара.ВыборНеТребуется;
	ЭтотОбъект.записать();
	
КонецПроцедуры

Процедура ОтправитьТоварВДругоеПодразделениеПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
		//АдресДоставки 								= Задача.АдресВнутреннейДоставки.АдресДоставки;
		//ДокументДоставки 							= Документы.УД_Доставка.СоздатьДокумент();
		//ДокументДоставки.Дата 						= ТекущаяДата();
		//ДокументДоставки.ПаспортныеДанныеПолучателя = АдресДоставки.ПаспортныеДанныеПолучателя;
		//ДокументДоставки.АдресДоставки 			    = АдресДоставки.АдресДоставки;
		//ДокументДоставки.Получатель    				= АдресДоставки.Получатель;
		//ДокументДоставки.Телефон       				= АдресДоставки.Телефон;
		//ДокументДоставки.ИНН   		   				= АдресДоставки.ИНН;
		//ДокументДоставки.ТипПеревозки  				= АдресДоставки.ТипПеревозки;
		//ДокументДоставки.ТранспортнаяКомпания 		= АдресДоставки.ТранспортнаяКомпания;
		//ДокументДоставки.ОплатаДоставки       		= АдресДоставки.ОплатаДоставки;

		//ДокументДоставки.ДокументОснование = ПеремещениеТоваров;
		//
		//БизнесПроцессы.ДокументДоствкиВнутренний = ДокументДоставки.Ссылка;
		Попытка
			Если не ЗначениеЗаполнено(ЭтотОбъект.ДокументДоствкиВнутренний) Тогда 
				АдресДоставки 								= Задача.АдресВнутреннейДоставки;
				ДокументДоставки 							= Документы.УД_Доставка.СоздатьДокумент();
				ДокументДоставки.Дата 						= ТекущаяДата();
				ДокументДоставки.ПаспортныеДанныеПолучателя = АдресДоставки.ПаспортныеДанныеПолучателя;
				ДокументДоставки.АдресДоставки 			    = АдресДоставки.АдресДоставки;
				ДокументДоставки.Получатель    				= АдресДоставки.Получатель;
				ДокументДоставки.Телефон       				= АдресДоставки.Телефон;
				ДокументДоставки.ИНН   		   				= АдресДоставки.ИНН;
				ДокументДоставки.ТипПеревозки  				= АдресДоставки.ТипПеревозки;
				ДокументДоставки.ТранспортнаяКомпания 		= АдресДоставки.ТранспортнаяКомпания;
				ДокументДоставки.ОплатаДоставки       		= АдресДоставки.ОплатаДоставки;
				
				ДокументДоставки.ДокументОснование = ПеремещениеТоваров;
				ДокументДоставки.Записать(РежимЗаписиДокумента.Проведение);
				
				ЭтотОбъект.ДокументДоствкиВнутренний = ДокументДоставки.Ссылка;
			КонецЕсли; 	
			ЭтотОбъект.НомерТТН     = Задача.НомерТТН;
			ЭтотОбъект.ДатаОтправки = Задача.ДатаОтправки;
			ЭтотОбъект.ТК           = Задача.АдресВнутреннейДоставки.ТранспортнаяКомпания;
			ЭтотОбъект.Записать();
		Исключение
			Сообщить("Произошла ошибка, обратитель к Руслану скопировав текст ошибки целиком " + ОписаниеОшибки(),СтатусСообщения.Важное);
		КонецПопытки;
КонецПроцедуры

Процедура ЗаказПоставщикуСозданПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Если ЗначениеЗаполнено(ЗаказПоставщику) Тогда 
		Результат = Истина;
	Иначе
		Результат = Ложь;
	КонецЕсли;
КонецПроцедуры

Процедура СвязатьсяСКлиетомПоПроблемнымСтрокамЗаказаПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	Для каждого Задача из ФормируемыеЗадачи цикл  
		задача.подразделение = РодительскийБизнесПроцес.ЗаказПокупателя.Подразделение;
		Если не ЗначениеЗаполнено(задача.подразделение) Тогда  
			Если ЭтотОбъект.РодительскийБизнесПроцес.ЗаказПокупателя.Ответственный = Справочники.Пользователи.Сайт Тогда 
				задача.подразделение  = Справочники.Подразделения.НайтиПоКоду("4"); 
			КонецЕсли;
		КонецЕсли;	
		Задача.заказПокупателя = РодительскийБизнесПроцес.ЗаказПокупателя;
	КонецЦикла;
КонецПроцедуры

Процедура ЕстьОплатаПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	ЗаказПокупателяЛок = РодительскийБизнесПроцес.ЗаказПокупателя;
	Если ry_ОбщиеПроцедуры.ЕстьОплата(ЗаказПокупателяЛок) Тогда 
		Результат = Истина;
	//ИначеЕсли ЗаказПокупателяЛок.ПодОтветственностьМенеджера Тогда 
	//	Результат = Истина;
	//ИначеЕсли ry_ОбщиеПроцедуры.ОплаченЧеком(ЗаказПокупателяЛок) Тогда 
	//	Результат = Истина;		
	//ИначеЕсли ry_ОбщиеПроцедуры.ЕстьПредоплата(ЗаказПокупателяЛок) Тогда 
	//	Результат = Истина;		
	ИначеЕсли ПеремещениеТовараПодОтветственностьМенеджера Тогда 
		 Результат = Истина;		
	Иначе		
		Результат = Ложь;		
	КонецЕсли;

КонецПроцедуры

Функция ПолучитьСтатусСтрокиЗаказа(ЗаказПокупателя,Номенклатура,Количество,ХарактеристикаНоменклатуры,Цена)
	
КонецФункции

Процедура СоздатьДокументРезервированиеТовараОбработка(ТочкаМаршрутаБизнесПроцесса)
	Документ = Документы.РезервированиеТоваров.СоздатьДокумент();
	Документ.ВидОперации = Перечисления.ВидыОперацийРезервированиеТоваров.ПоЗаказам;
	Документ.Дата = ТекущаяДата()+1;
	Документ.Заказ = РодительскийБизнесПроцес.ЗаказПокупателя;
	Строка = Документ.Товары.Добавить();
	Строка.ЕдиницаИзмерения = Номенклатура.ЕдиницаХраненияОстатков;
	Строка.Количество = Количество;
	Строка.Коэффициент = 1;
	Строка.Номенклатура = Номенклатура;
	Строка.ХарактеристикаНоменклатуры = ХарактеристикаНоменклатуры;
	Строка.НовоеРазмещение = СкладВыдачи;
	Документ.Комментарий = "Созанно бизнесс процессов " + Номер;
	Документ.Записать(РежимЗаписиДокумента.Проведение);
КонецПроцедуры


Процедура ПеремещениеТовараПриСозданииВложенныхБизнесПроцессов(ТочкаМаршрутаБизнесПроцесса, ФормируемыеБизнесПроцессы, Отказ)
	
	Для каждого БП из ФормируемыеБизнесПроцессы цикл
		БП.ЗаказПокупателя = РодительскийБизнесПроцес.ЗаказПокупателя;
		ВедущаяЗадача = БП.ВедущаяЗадача;
		ЗаполнитьЗначенияСвойств(БП,ЭтотОбъект);
		БП.Номер = Неопределено;
		БП.РодительскийБизнесПроцес = ЭтотОбъект.Ссылка;
		БП.Стартован = Ложь;
		БП.ВедущаяЗадача = ВедущаяЗадача;
	КонецЦикла;
	

КонецПроцедуры


Процедура ПеремещениеТовараПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	ЗадачаОб = Задача.ПолучитьОбъект();
	ЗадачаОб.ВыполнитьЗадачу();
КонецПроцедуры


Процедура ПеремещениеТовараПередСозданиемВложенныхБизнесПроцессов(ТочкаМаршрутаБизнесПроцесса, ФормируемыеБизнесПроцессы, Отказ)
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура ПеревестиВСтатусОтказаноСкладомОбработка(ТочкаМаршрутаБизнесПроцесса)
	
КонецПроцедуры


Процедура ПодтвердитьСнятиеЗапчастиПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	////Для каждого Задача из ФормируемыеЗадачи Цикл 
	////	
	////	Задача.подразделение = СкладСОстаткомТовара.Подразделение;
	////	//Задача.Подразделение              = СкладВыдачи.Подразделение;
	////	Задача.Номенклатура  		      = Номенклатура;
	////	Задача.ХарактеристикаНоменклатуры = ХарактеристикаНоменклатуры;
	////	Задача.СкладДляПроверкиОстатка    = СкладВыдачи;
	////	Задача.типЗадачи                  = Перечисления.БП_ТипыЗадач.ПодтвердитьСнятиеЗапчасти;
	////	Задача.Количество				  = Количество;
	////	Задача.ЗаказПокупателя			  = РодительскийБизнесПроцес.ЗаказПокупателя;
	////	
	////КонецЦикла;

КонецПроцедуры

Процедура ЗапчастьРазрешеноСнятьПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)

КонецПроцедуры

Процедура ТоварОплаченПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = ЕстьОплата(РодительскийБизнесПроцес.ЗаказПокупателя);
КонецПроцедуры

Функция ЕстьОплата(ЗаказПокупателя) Экспорт 
	
	ВозвращаемоеЗначение = Ложь;
	
	СуммаДолгаПоКорректировке = 0;
	
	ЗапросПоСуммеКорректировки = новый Запрос;
	ЗапросПоСуммеКорректировки.Текст = "ВЫБРАТЬ
	                                   |	ЕстьNULL(СУММА(КорректировкаЗаказаПокупателя.СуммаДокумента),0) КАК СуммаДокумента
	                                   |ИЗ
	                                   |	Документ.КорректировкаЗаказаПокупателя КАК КорректировкаЗаказаПокупателя
	                                   |ГДЕ
	                                   |	КорректировкаЗаказаПокупателя.ЗаказПокупателя = &ЗаказПокупателя";
	ЗапросПоСуммеКорректировки.УстановитьПараметр("ЗаказПокупателя",ЗаказПокупателя);
	
	РезультатЗапросаПоСуммеКорректировки = ЗапросПоСуммеКорректировки.Выполнить().Выгрузить();
	Если РезультатЗапросаПоСуммеКорректировки.Количество()>0 Тогда 
		СуммаДолгаПоКорректировке = РезультатЗапросаПоСуммеКорректировки[0].СуммаДокумента;
	КонецЕсли;
		
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОплатаОтПокупателяПлатежнойКартой.СуммаДокумента КАК СуммаДокумента
	               |ИЗ
	               |	Документ.ОплатаОтПокупателяПлатежнойКартой КАК ОплатаОтПокупателяПлатежнойКартой
	               |ГДЕ
	               |	ОплатаОтПокупателяПлатежнойКартой.Проведен
	               |	И ОплатаОтПокупателяПлатежнойКартой.ДокументОснование = &ЗаказПокупателя
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ПлатежноеПоручениеВходящее.СуммаДокумента
	               |ИЗ
	               |	Документ.ПлатежноеПоручениеВходящее КАК ПлатежноеПоручениеВходящее
	               |ГДЕ
	               |	ПлатежноеПоручениеВходящее.Проведен
	               |	И ПлатежноеПоручениеВходящее.РасшифровкаПлатежа.Сделка = &ЗаказПокупателя
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ПриходныйКассовыйОрдер.СуммаДокумента
	               |ИЗ
	               |	Документ.ПриходныйКассовыйОрдер КАК ПриходныйКассовыйОрдер
	               |ГДЕ
	               |	ПриходныйКассовыйОрдер.Проведен
	               |	И ПриходныйКассовыйОрдер.РасшифровкаПлатежа.Сделка = &ЗаказПокупателя";
	Запрос.УстановитьПараметр("ЗаказПокупателя",ЗаказПокупателя);
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество()>0 Тогда  
		Если РезультатЗапроса[0].СуммаДокумента >= ЗаказПокупателя.СуммаДокумента+СуммаДолгаПоКорректировке Тогда 
			//Полученна оплата
			ВозвращаемоеЗначение =  Истина;
		Иначе
			//Не полученна оплата
			ВозвращаемоеЗначение =  Ложь;
		КонецЕсли;
	Иначе
		ВозвращаемоеЗначение =  Ложь;
	КонецЕсли;
	
	Если не ВозвращаемоеЗначение Тогда 
		
		ЗапросПоВзаиморасчетам = новый запрос;
		//ЗапросПоВзаиморасчетам.Текст = ;
		
	КонецЕсли;
	
	Если ЗаказПокупателя.ПодОтветственностьМенеджера Тогда 
		ВозвращаемоеЗначение = Истина;
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Процедура СамовывозПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = СпособДоставки = Перечисления.БП_СпособыДоставки.Самовывоз;
КонецПроцедуры

Процедура Действие4ПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	Для Каждого  Задача из ФормируемыеЗадачи цикл
		Задача.Подразделение              = СкладВыдачи.Подразделение;
		Задача.Номенклатура  		      = Номенклатура;
		Задача.ХарактеристикаНоменклатуры = ХарактеристикаНоменклатуры;
		Задача.СкладДляПроверкиОстатка    = СкладВыдачи;
		Задача.типЗадачи                  = Перечисления.БП_ТипыЗадач.ПроверитьОстаток;
		Задача.Количество				  = Количество;
		Задача.ЗаказПокупателя			  = РодительскийБизнесПроцес.ЗаказПокупателя;
	КонецЦикла;

КонецПроцедуры


Функция ПолучитьДокументДвиженияСтрок(ЗаказПокупателя)
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СтатусыСтрокЗаказаОбороты.Регистратор
	               |ИЗ
	               |	РегистрНакопления.СтатусыСтрокЗаказа.Обороты(, , Регистратор, СтрокаЗаказа.ЗаказПокупателя = &ЗаказПокупателя) КАК СтатусыСтрокЗаказаОбороты";
	Запрос.УстановитьПараметр("ЗаказПокупателя",ЗаказПокупателя);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() Тогда 
		Возврат РезультатЗапроса[0].Регистратор;
	Иначе
		Возврат Неопределено;
	КонецЕсли;	
КонецФункции

Процедура ЗарезервироватьОбработка(ТочкаМаршрутаБизнесПроцесса)
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток
	               |ИЗ
	               |	РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки КАК ТоварыВРезервеНаСкладахОстатки
	               |ГДЕ
	               |	ТоварыВРезервеНаСкладахОстатки.ДокументРезерва = &ДокументРезерва
	               |	И ТоварыВРезервеНаСкладахОстатки.Номенклатура = &Номенклатура";
	Запрос.УстановитьПараметр("ДокументРезерва",РодительскийБизнесПроцес.ЗаказПокупателя);
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	
	РезультатЗапроса = запрос.Выполнить().Выгрузить();
	
	Если не РезультатЗапроса.Количество() Тогда 
		Документ = Документы.РезервированиеТоваров.СоздатьДокумент();
		Документ.ВидОперации = Перечисления.ВидыОперацийРезервированиеТоваров.ПоЗаказам;
		Документ.Дата  = ТекущаяДата()+1;
		Документ.Заказ = РодительскийБизнесПроцес.ЗаказПокупателя;
		Строка = Документ.Товары.Добавить();
		Строка.ЕдиницаИзмерения = Номенклатура.ЕдиницаХраненияОстатков;
		Строка.Количество   = Количество;
		Строка.Коэффициент  = 1;
		Строка.Номенклатура = Номенклатура;
		Строка.ХарактеристикаНоменклатуры = ХарактеристикаНоменклатуры;
		Строка.ИсходноеРазмещение = ЗаказПоставщику;
		Строка.НовоеРазмещение	  = СкладВыдачи;
		Документ.Комментарий = "Созанно бизнесс процессов " + Номер;
		Документ.Записать(РежимЗаписиДокумента.Проведение);
		
	КонецЕсли;
	
КонецПроцедуры


//Чернавцев Н.А. по задаче №45525 06.07.21 Начало

Процедура Обработка3Обработка(ТочкаМаршрутаБизнесПроцесса)

КонецПроцедуры

Процедура РазукомплектоватьКомплектующиеНеРазборногоКомплекта()
	
КонецПроцедуры

Процедура РазукомплектоватьКомплектующиеРазборногоКомплекта()
	
КонецПроцедуры

Функция ДелатьИзНеРазборногоКомплекта(ХарактеристикаНоменклатуры)

	ВозвращаемоеЗначение = Ложь;	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция ДелатьИзРазборногоКомплекта(ХарактеристикаНоменклатуры)

	ВозвращаемоеЗначение = Ложь;	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция ПолучитьНоменклатуруХарактеристикуКомплекта(Характеристика)
	
	Запрос = новый запрос;
	Запрос.Текст ="ВЫБРАТЬ
	              |	ЗначенияСвойствОбъектов.Значение
	              |ИЗ
	              |	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	              |ГДЕ
	              |	ЗначенияСвойствОбъектов.Объект = &Объект
	              |	И ЗначенияСвойствОбъектов.Свойство = &Свойство";
	Запрос.УстановитьПараметр("Объект",Характеристика);
	Запрос.УстановитьПараметр("Свойство",ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("6.Номер комплекта"));
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() Тогда 
			НомерКомплекта = РезультатЗапроса[0].Значение;
			
			Запрос = новый запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	Комплект.Объект
			               |ИЗ
			               |	(ВЫБРАТЬ
			               |		ЗначенияСвойствОбъектов.Объект КАК Объект
			               |	ИЗ
			               |		РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
			               |	ГДЕ
			               |		ЗначенияСвойствОбъектов.Свойство = &СвойствоНомер
			               |		И ЗначенияСвойствОбъектов.Значение = &ЗначениеНомер) КАК Комплект
			               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ВидКомплектации
			               |		ПО Комплект.Объект = ВидКомплектации.Объект
			               |ГДЕ
			               |	ВидКомплектации.Свойство = &СвойствоВидКомплектации
			               |	И ВидКомплектации.Значение = ЗНАЧЕНИЕ(Перечисление.зетаБУВидыКомплектации.ПустаяСсылка)";
			Запрос.УстановитьПараметр("СвойствоВидКомплектации",ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("4.Вид комплектации"));
			Запрос.УстановитьПараметр("СвойствоНомер",ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("6.Номер комплекта"));
			Запрос.УстановитьПараметр("ПустоеСвойстоВидКомплектации",Перечисления.зетаБУВидыКомплектации.ПустаяСсылка());
			Запрос.УстановитьПараметр("ЗначениеНомер",НомерКомплекта);

			РезультатЗапроса = Запрос.Выполнить().Выгрузить();
			
			Если РезультатЗапроса.Количество() Тогда 
				Возврат РезультатЗапроса[0].Объект;
			Иначе
				Возврат Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
			КонецЕсли;
		Иначе
				Возврат Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	КонецЕсли;
	
	
	
КонецФункции

Функция ПолучитьСкладОсновнойДелали(Номенклатура,Характеристика)
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТоварыНаСкладахОстатки.Склад
	               |ИЗ
	               |	РегистрНакопления.ТоварыНаСкладах.Остатки(
	               |			,
	               |			Номенклатура = &Номенлкатура
	               |				И ХарактеристикаНоменклатуры = &Характеристика) КАК ТоварыНаСкладахОстатки";
	Запрос.УстановитьПараметр("Номенлкатура",Номенклатура);
	Запрос.УстановитьПараметр("Характеристика",Характеристика);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() Тогда 
		Возврат РезультатЗапроса[0].Склад; 	
	КонецЕсли;
КонецФункции

Процедура Обработка1Обработка(ТочкаМаршрутаБизнесПроцесса)	
	
КонецПроцедуры

Процедура Обработка4Обработка(ТочкаМаршрутаБизнесПроцесса)

КонецПроцедуры

Процедура ОбработкаРазукомплектоватьКомплектующиеРазборныеОбработка(ТочкаМаршрутаБизнесПроцесса)

КонецПроцедуры

Процедура Условие1ПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	
КонецПроцедуры

Процедура СистемаЖдетОплатыПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	
КонецПроцедуры

//Чернавцев Н.А. по задаче №45525 06.07.21 Конец
